Revit 2027 API
ThermalAsset.Compressibility Property
 The compressibility of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Compressibility { get; set; }
Public Property Compressibility As Double
	Get
	Set
public:
property double Compressibility {
	double get ();
	void set (double value);
}
member Compressibility : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for compressibility is out of range
Remarks
 Values must be in the range 0 to 1.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace